[net]
# 测试时用
# batch=1
# subdivisions=1
# 训练使用
batch=64
subdivisions=2
width=320
height=320
channels=3
momentum=0.9
decay=0.0005
# 以下4个参数用来调整图片,生成更多的数据集
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
burn_in=1000
max_batches = 500200
policy=steps
steps=400000,450000
scales=.1,.1

[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=1

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

###########

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
# fileters = 第1层anchor数量(5+第1层类别数量)
filters=18
activation=linear


# 第1层输出(yolov3-tiny 共输出2层数据)
[yolo]
# 选择哪几组anchor
mask = 3,4,5
anchors = 44, 39,  82, 78, 173, 91, 120,144, 193,177, 280,189
# 类别数量,根据需求更改
classes=1
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1

[route]
layers = -4

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 8

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
# fileters = 第2层anchor数量(5+第2层类别数量)
filters=18
activation=linear

# 第2层输出(yolov3-tiny 共输出2层数据)
[yolo]
# 选择哪几组anchor
mask = 0,1,2
anchors = 44, 39,  82, 78, 173, 91, 120,144, 193,177, 280,189
# 类别数量,根据需求更改
classes=1
# anchor的数量,和anchors实际数量对应
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1